FROM python:3.10

# Указание интерпретатору Python не создавать компилированные файлы `.pyc` при запуске программы, 
# включение этой опции позволяет ускорить процесс запуска и уменьшить использование дискового пространства
ENV PYTHONDONTWRITEBYTECODE=1

# Включение обработчика сбоев (fault handler) в Python, 
# позволяет получать детализированную информацию при возникновении ошибок
ENV PYTHONFAULTHANDLER=1

# Отключение буферизации вывода в Python для отображения вывода без задержки
ENV PYTHONUNBUFFERED=1

# Задание случайного значения для семени хэша в Python,
# это может повлиять на устранение возможных уязвимостей, связанных с коллизиями хэшей
ENV PYTHONHASHSEED=random

# Отключение кэширования пакетов pip
ENV PIP_NO_CACHE_DIR=off

# Отключение проверки версии pip при выполнении команды pip
ENV PIP_DISABLE_PIP_VERSION_CHECK=on

# Установка тайм-аута по умолчанию для команд pip на 100 секунд
ENV PIP_DEFAULT_TIMEOUT=100

# Установка необходимых зависимостей для разработки с использованием PostgreSQL в Linux
RUN apt-get update && \   

  # Установка пакетов, указанных в следующих строках, без установки рекомендуемых пакетов, с подтверждением
  apt-get install --no-install-recommends -y \

  # Установка основных инструментов и компилятора, необходимых для создания программного обеспечения
  build-essential \

  # Установка инструментов для работы с локализацией и международными сообщениями
  gettext \

  # Устанавка разработочных файлов PostgreSQL, необходимых для сборки и установки 
  # библиотеки psycopg2 для работы с PostgreSQL
  libpq-dev \

  # Удаление автоматически установленных пакетов, которые больше не нужны в системе
  apt-get autoremove -y && \ 

  # Очистка кэша пакетов и временных файлов для освобождения пространство на диске
  apt-get clean -y && \

  # Удаление содержимого директории `/var/lib/apt/lists/`, где хранятся списки доступных пакетов, 
  # чтобы освободить пространство на диске
  rm -rf /var/lib/apt/lists/*

WORKDIR /app
RUN pip install --upgrade pip
COPY ./req.txt .
RUN pip install -r req.txt
COPY init.sql /docker-entrypoint-initdb.d/init.sql
COPY . .